<template>
  <div class="terms-wrapper">
    <div class="terms-container">
      <h1>利用規約</h1>
      <dl>
        <dd>この利用規約（以下「本規約」といいます）は，このウェブサイト(GESONTACLE)上で提供するサービス（以下「本サービス」といいます）の利用条件を定めるものです。</dd>
        <dd>ユーザーの皆さま（以下「ユーザー」といいます）には、本規約に従って本サービスをご利用いただきます。</dd>
      </dl>
      <div class="border" />
      <h4 class="mt-4 mb-1">第1条（適用）</h4>
      <ol>
        <li>本規約はユーザーの本サービスの利用に関わる一切に適用されるものとします。</li>
        <li>本サービスは本規約のほか、ご利用にあたっての注意事項等の定め（以下「個別規定」といいます）をすることがあります。これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。</li>
        <li>本規約の規定が前条の個別規定の規定と矛盾する場合には、個別規定において特段の定めなき限り個別規定の規定が優先されるものとします。</li>
        <li>ユーザーが未成年である場合は、親権者等法定代理人の同意を得たうえで本サービスを利用するものとします。</li>
      </ol>
      <div class="border" />
      <h4 class="mt-4 mb-1">第2条（本サービスの利用）</h4>
      <ol>
        <li>ユーザーは、本サービスの利用にあたっては、本規約及び個別規約のほか各種法令を遵守するものとします。</li>
        <li>本サービスを利用するために必要なあらゆるハード・ソフトウェア等の整備は、ユーザーの負担と責任において行うものとします。</li>
        <li>ユーザーは、自己の利用環境に応じて、コンピューター・ウィルスの感染の防止、不正アクセス及び情報漏洩の防止等の対策を講じるものとします。</li>
        <li>本サービス運営は、ユーザーの利用環境について一切関与せず、また一切の責任を負いません。</li>
      </ol>
      <div class="border" />
      <h4 class="mt-4 mb-1">第3条（禁止事項）</h4>
      <ol>
        <li>ユーザーは本サービスの利用にあたり、以下の行為をしてはなりません。</li>
        <ul>
          <li>法令または公序良俗に違反する行為</li>
          <li>犯罪行為に関連する行為</li>
          <li>本サービスの他のユーザー、または第三者のサーバー・ネットワークの機能を破壊したり、妨害したりする行為</li>
          <li>本サービスの運営を妨害するおそれのある行為</li>
          <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
          <li>不正アクセスをし、またはこれを試みる行為</li>
          <li>本サービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
          <li>本サービスの他のユーザーまたは第三者の知的財産権・肖像権・プライバシー・名誉その他の権利または利益を侵害する行為</li>
        </ul>
      </ol>
      <div class="border" />
      <h4 class="mt-4 mb-1">第4条（本サービスの提供の停止等）</h4>
      <ol>
        <li>本サービス運営は以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。</li>
        <ul>
          <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
          <li>地震・落雷・火災・停電または天災などの不可抗力により本サービスの提供が困難となった場合</li>
          <li>コンピュータまたは通信回線等が事故により停止した場合</li>
          <li>その他本サービスの提供が困難と判断した場合</li>
          <li>本サービス運営は、本サービスの提供の停止または中断によりユーザーまたは第三者が被ったいかなる不利益または損害についても一切の責任を負わないものとします。</li>
        </ul>
      </ol>
      <div class="border" />
      <h4 class="mt-4 mb-1">第5条（保証の否認および免責事項）</h4>
      <ol>
        <li>本サービス運営は、本サービスに事実上または法律上の瑕疵（安全性・信頼性・正確性・完全性・有効性・特定の目的への適合性・セキュリティなどに関する欠陥・エラーやバグ・権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。</li>
        <li>本サービス運営は、本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。</li>
        <li>本サービス運営は、不法行為によりユーザーに生じた損害について一切の責任を負いません。</li>
        <li>本サービス運営は、本サービスに関してユーザーと他のユーザーまたは第三者との間において生じた取引・連絡または紛争等について一切責任を負いません。</li>
      </ol>
      <div class="border" />
      <h4 class="mt-4 mb-1">第6条（ユーザー情報の取り扱い）</h4>
      <ol>
        <li>本サービス運営は、ユーザーのプライバシーを尊重し、プライバシー情報を適切に扱うためセキュリティに最大限の注意を払います。</li>
        <li>本サービス運営は、サービス運営のためにユーザーから情報を収集することがあります。それらは、本サービスのプライバシーポリシーに従い、責任をもって収集・利用・保護にあたります。</li>
        <li>本サービスは、特定のユーザーを識別しない方式にて本サービスの利用状況（本サービスの利用回数等）の情報を取得します。取得した情報は本サービスの機能提供及びサービスの向上のためにのみ利用します。</li>
      </ol>
      <div class="border" />
      <h4 class="mt-4 mb-1">第7条（知的財産）</h4>
      <ol>
        <li>本サービスに含まれているコンテンツ及び個々の情報､商標､画像､広告､デザイン等に関する著作権､商標権その他の知的財産権、及びその他の財産権は全て本サービス運営または正当な権利者に帰属しています｡</li>
        <li>本サービス及び関連して使用されている全てのソフトウェアは､知的財産権に関する法令等により保護されている財産権を含んでいます｡</li>
      </ol>
      <div class="border" />
      <h4 class="mt-4 mb-1">第8条（紛争処理）</h4>
      <ol>
        <li>本規約の準拠法は、日本法であり、利用者と本サービス間で紛争が生じた際は東京地方裁判所を専属的合意管轄裁判所とします。</li>
      </ol>
      <div class="border" />
      <h4 class="mt-4 mb-1">第9条（本規約の変更）</h4>
      <ol>
        <li>本規約及び個別規約は本サービス運営の判断により、事前にユーザーへの通知なく変更・改定を行うことができます。</li>
        <li>本規約及び個別規約が変更された場合、ユーザーの当該変更後の利用には変更後の規約が適用され、ユーザーは当該変更に同意したものとみなします。</li>
      </ol>
      <div class="border" />
      <h4 class="mt-4 mb-1">第10条（付則）</h4>
      <p>2020年12月28日 制定</p>
    </div>
  </div>
</template>

<style>
.terms-wrapper {
  padding: 20px;
}

.terms-container {
  padding: 10px;
  margin-bottom: 20px;
  box-shadow: 5px 5px 20px var(--border-dark), -5px -5px 20px var(--border-dark);
}
</style>